In [1]:
import pandas as pd               
import IPython           # for displaying the data structures

In [2]:
# Series

s = pd.Series([5,7,8,2,3],index=['a','b','c','d','e'])         # 1D labelled array capable of holding any data types
display(s)

a    5
b    7
c    8
d    2
e    3
dtype: int64

In [3]:
# Dataframe
data = {'Country' : ['india','france','england'],
       'Capital' : ['New dehli','Paris','landon'],
       'Population' : [134212015,111908046,204565789]}
df = pd.DataFrame(data,columns=['Country','Capital','Population'])
display(df)

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

In [7]:
# input and ouput

# read and write csv
df.to_csv('country.csv',index=None)             # Creates a csv file with values of df and no index
df1 = pd.read_csv('country.csv')                # reads values from country.csv and saves it to df1
display(df1)                                    # display df1 

# read and write from excel
df.to_excel('country.xlsx',sheet_name='country')            # writes values of df to counrty.xlsx
df2 = pd.read_excel('country.xlsx',sheetname='country')     # reads values from country.xlsx and saves it to df2
display(df2)                                                # display df2

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

In [24]:
# selection

# getting elements
display(s)                                        # display array 
print(s['b'],' = value of b\n')                   # get one element

display(df)                                       # display dataframe
print(df[1:],' = subset of df\n')                 # get subset of dataframe

# by position
print(df.iloc[0,0],' = element at 0th row and 0th coloumn\n')                          # select single value by row and coloumn
print(df.iat[2,0],' = element at 2nd row and 0th coloumn\n')                           # select element at sepcifiedlocation

# by label
print(df.loc[0,'Country'],' = element at 0th row and under the coloumn of country\n')  # select single value by row and coloumn labels
print(df.at[1,'Country'],' = element at 1st row and under the coloumn of country\n')   # select single value by row and coloumn labels

# by label 
print(df.ix[2],' = select row 2\n')                                                    # select single row of subset of rows
print(df.ix[:,'Capital'],' = select capital coloumn\n')                                # select single coloumn of subset of coloumn 
print(df.ix[1,'Capital'],' = select 1 st row element in capital\n')                    # select rpw and coloumn

# boolean indexing 
print(df[df['Population']>12000000],' = population > 120000000\n')                     # filter to adjust dataframe
print(s,'\n')                                                                          # display s
print(s[~(s>3)],' = elements graeter than 3\n')                                        # series where value is not > 3    
print(s[(s < 1) | (s > 4)],'= <1 or >4\n')                                             # s value where s is < 1 or > 4 

# setting
s['a'] = 10                                                                            # set index value a to 10 
display(s)

a    10
b     7
c     8
d     2
e     3
dtype: int64

7  = value of b

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

   Country Capital  Population
1   france   Paris   111908046
2  england  landon   204565789  = subset of df

india  = element at 0th row and 0th coloumn

england  = element at 2nd row and 0th coloumn

india  = element at 0th row and under the coloumn of country

france  = element at 1st row and under the coloumn of country

Country         england
Capital          landon
Population    204565789
Name: 2, dtype: object  = select row 2

0    New dehli
1        Paris
2       landon
Name: Capital, dtype: object  = select capital coloumn

Paris  = select 1 st row element in capital

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789  = population > 120000000

a    10
b     7
c     8
d     2
e     3
dtype: int64

d    2
e    3
dtype: int64  = elements graeter than 3

a    10
b     7
c     8
dtype: int64 = <1 or >4

a    10
b     7
c     8
d     2
e     3
dtype: int64